{
    "limit": 10,
    "offset": 0,
    "program_cards": [
        {
            "program_key": "1225",
            "program_name": "Systems Design Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Everything on our planet interacts – transportation networks, energy transfer, and biological systems – but how do they work together? Systems Design Engineering looks at the big picture to find the connections that advance technology and innovation. You’ll learn the fundamentals in electrical, mechanical, and software engineering to prepare for a career with the flexibility to solve the world's biggest problems.  You’ll examine the people, materials, tools, software, and other factors involved in any engineering problem. You’ll learn to look at the system as a whole and assess how one change will affect another element, using a variety of modelling, analysis, and design methods. Our project-based approach gives you lots of opportunity to apply your learning to real problems in a wide range of industries. Plus you’ll graduate with two full years of paid work experience through North America's largest co-op program. By graduation, you’ll be ready to develop comprehensive, ground-breaking solutions for the toughest engineering problems. Think everything from heath-care management to advanced cyber-physical security and complex energy systems. Unlimited innovation opportunities. Use a \"big picture\" approach to solve problems. Our grads go on to engineering consulting, project management, graduate school, medical school, start-ups, and more. Multi-directional engineering. Learn fundamentals in electrical, mechanical, and software engineering with an overarching focus on engineering design and systems-driven thinking. Choose from 300 different electives to gain a well-rounded experience! With its renowned co-op program and a supportive entrepreneurial ecosystem, Waterloo Engineering is one of the world’s top engineering schools. You'll have access to emerging technologies, innovative professors, and world-class facilities. During your first year, you'll take foundational courses exploring subjects like communication in system design, digital computation, and physics. Learn more about the courses you'll take for your Systems Design Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Waterloo Systems Design Engineering graduates commonly pursue careers in business analysis, technology consulting, and applications engineering. They often utilize their interdisciplinary skills to work for manufacturing companies, accounting firms, technology companies, and more. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Formula Motorsports, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Regardless of gender, orientation, or background, you’re welcome to join this inclusive community to participate in outreach events as well as mentorship and volunteer opportunities. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 250+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the high 80s to low 90s. Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1231",
            "program_name": "Management Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Cut waiting times for surgery. Streamline supply chains. Fine-tune airline routes. In Canada’s first and only Management Engineering program, you’ll learn to analyze how organizations operate and apply engineering skills to increase their efficiency. Over the course of your degree, you’ll develop expertise in data analytics, information systems, operations and supply chain management, and organizational behaviour. You'll also have the opportunity to gain paid work experience through co-op. By graduation, you’ll have the know-how to design and manage complex systems, optimizing the flow of energy, materials, people, and information. And you’ll find no shortage of companies looking for your skills: in software, finance, supply chain management, health care, manufacturing, and more. In Canada's first Management Engineering program, you'll learn to use industrial engineering principles, advanced analytics, math, and computer programming to optimize and improve processes in any organization. During your first year, you'll take a mix of Management Engineering, math, physics, and communication courses. In upper years, most of your classes will be in Management Engineering. Learn more about the courses you'll take for your Management Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Graduates often pursue careers in software development, big data analysis, and industrial engineering. They commonly work for research centres, technology companies, and more. Learn about the future of careers in business. In a typical business degree program, you concentrate more on business functions such as accounting, finance, sales, human resources, and marketing and earn credits to qualify for professional designations such as Chartered Financial Analyst (CFA) and Chartered Professional Accountant (CPA).  In contrast, Management Engineering provides more focus and greater depth in science, mathematics, and engineering design and deals with identifying and solving the problems that organizations face when deciding how to make better products and how to run the business more efficiently and effectively. As a Management Engineering graduate, you’ll be eligible to apply for a professional engineering (PEng) designation.  Nevertheless, you’ll take a number of courses – required and electives – that may traditionally be found in business programs, covering topics such as economics, finance, organizational behaviour and design, management of technology, and entrepreneurship.  Software Engineering applies computer science and engineering to design software systems. You’ll take lots of computer science and computer engineering courses at the interface of digital hardware and software, as well as core software engineering courses on software development.  In contrast, management engineers design, implement, and manage complex management systems. Increasingly, those management systems are implemented as software and information systems. Therefore, information/software systems design comprises a major theme area in Management Engineering, with a number of courses in computer science, software engineering, and information systems.  As a Management Engineering student, you’ll learn to solve large real-world problems of businesses and organizations that are implemented in software. As a Software Engineering student, you’ll earn to solve a wide range of software problems including low-level systems programming.  According to the Institute for Industrial and Systems Engineers, industrial engineers design processes and systems that improve quality and productivity by eliminating waste of time, money, materials, energy, or other commodities. There are some similarities between management and industrial engineering programs, including a significant overlap in the type of courses in the two programs. In fact, management engineering could be considered a contemporary industrial engineering program.  While the Management Engineering curriculum has a large overlap with many industrial engineering programs at other universities, there are two main differences. In general, you’ll likely be with the same students for most courses throughout the program. Usually, we’re able to schedule all of the Management Engineering students to be in the same classes. In later years, as you begin to take electives, you’ll likely find yourself in classes with students from other engineering programs.  Each cohort of students is different, but females typically make up 40-50% of the students in Management Engineering. The first-year Management Engineering class in 2019 was about 46% female.  Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 250+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the mid- to high 80s Previous experience in programming is recommended. Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1232",
            "program_name": "Biomedical Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Design bionic limbs. Create laser-guided surgical devices. Enhance cancer-imaging systems. Develop wearable tech that keeps populations healthy, improves athletic performance. In Biomedical Engineering, you’ll use engineering know-how to develop better ways to diagnose illnesses, treat health problems, and enhance health. You’ll study biomechanics, physics, chemistry, and design. With that broad knowledge, you’ll be able to collaborate with all kinds of different experts: biologists, medical practitioners, policy makers, and engineers, to name a few. You’ll also learn to model and design complex biomedical systems—and you’ll get plenty of hands-on experience through two years of paid co-op work terms, plus a fourth-year design project. By the time you graduate, you’ll be ready to create tomorrow’s life-saving and life-enhancing innovative technologies. With its renowned co-op program and a supportive entrepreneurial ecosystem, Waterloo Engineering is one of the world’s top engineering schools. You'll have access to emerging technologies, innovative professors, and world-class facilities. During your first year, you'll take a mix of Biomedical Engineering and math courses. Learn more about courses you'll take for your Biomedical Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Graduates often pursue careers in health, design, robotics, and research. They usually work in health care centres, laboratories, and more. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Formula Motorsports, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Regardless of gender, orientation, or background, you’re welcome to join this inclusive community to participate in outreach events as well as mentorship and volunteer opportunities. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 250+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Biomedical Sciences is the study of life from a medical perspective. You’ll learn about the body, disease, healing processes, genetics, physiology–the knowledge of how the body works and responds to stimuli. Biomedical Engineering is the application of that scientific knowledge to develop medical technology. For instance, a surgeon needs to understand biomedical science to operate on a patient – and might use laser-guided surgical devices, artificial internal organs, or replacements for body parts developed by a biomedical engineer. The two work in tandem, but their approach is different. Is Biomedical Engineering a path to become a doctor? In theory, yes, although it’s not recommended because it can be difficult to take the courses required to apply to medical school. The decision is whether you want to be a doctor or an engineer. Biomedical Sciences is a good route to becoming a doctor or other health care professional. Biomedical Engineering leads to becoming an engineer, usually in the medical field. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the mid-90s Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1233",
            "program_name": "Software Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Whether you want to create a VR training program for surgeons, the next innovative OS, or tomorrow’s fleet of autonomous vehicles, software engineers have endless career options in today’s tech-enabled world. At Waterloo, you won’t just write code. You’ll also analyze software architecture, apply algorithms, understand digital hardware systems, and design human/ computer interfaces. Plus, you’ll learn how to work in teams and manage projects, all while being taught within one of the best universities in the world for software engineering (Shanghai World University Rankings 2021). Then, during your co-op, you’ll put those skills to work at leading companies like Snapchat, Facebook, or hot new startups. When you graduate, you’ll be ready to create reliable, affordable, and faster software for all kinds of different purposes. With its renowned co-op program and a supportive entrepreneurial ecosystem, Waterloo Engineering is one of the world’s top engineering schools. You'll have access to emerging technologies, innovative professors, and world-class facilities. During your first year, you'll take a mix of foundational courses in Software Engineering, Computer Science, and Math. In upper years, you'll mostly take Software Engineering courses. Learn more about the courses you'll take for your Software Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Graduates often pursue careers in software engineering and development, consulting, and more. They commonly work for financial institutions, technology companies, and software corporations. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Formula Motorsports, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! As Waterloo Computer Science student, you’ll also have the opportunity to participate in competitions such as Hack the North. This hack-a-thon is the largest in Canada and hosted annually at Waterloo. Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 250+ student-run clubs, sports and recreation, student government, and events, student life at Waterloo has something for everyone. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Regardless of gender, orientation, or background, you’re welcome to join this inclusive community to participate in outreach events as well as mentorship and volunteer opportunities. Women in Science, Technology, Engineering, and Mathematics (WiSTEM) is a student-run club that welcomes all students (regardless of gender) to promote equality in STEM. Opportunities include skills workshops, discussions, homework help, and guest speakers. Ontario students: six Grade 12 U and/or M courses including Experience in developing well-structured, modular programs is required. Grade 11 U Introduction to Computer Science and Grade 12 U Computer Science are recommended as helpful background for the program. Admission averages: Individual selection from the mid-90s Not studying in Ontario? Search our admission requirements. Complete the Admission Information Form once you've applied. You will be asked to explain your programming experience. Participation in a programming contest, such as the Canadian Computing Competition, is helpful to include on your AIF. You’re also encouraged to write the Euclid Mathematics Contest as good background; however, this will not affect your application to Software Engineering. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1239",
            "program_name": "Mechatronics Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Autonomous vehicles, drones, 3D printers, smartphones, satellite systems, and yes, robotics, are all the kinds of the computer-controlled electromechanical systems that you will learn to design. In the first program of its kind in Canada, you’ll develop expertise in mechanical engineering, control engineering, electronics, and computer science, pulling together know-how from these different fields to develop sophisticated machines. During your co-op terms, you’ll have the chance to try out different career paths, earn money to pay for your education, and build a résumé guaranteed to impress potential employers. Part of Canada's largest engineering school, the Mechanical and Mechatronics Engineering department at Waterloo is home to nearly 1,600 undergraduates, graduate students, faculty, and staff. During your first year, you'll take a mix of foundational classes in engineering and math. In your upper years, most of your classes will be in Mechatronics Engineering.  Learn more about the courses you'll take for your Mechatronics Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Graduates often pursue careers in product and software design, technology analysis, program coordination, and more. They usually work for technology companies, manufacturers, and telecommunications companies. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 200+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission average: Individual selection from the high 80s to low 90s Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1240",
            "program_name": "Chemical Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Learn to engineer the products we use every day: energy, food, medicine, and so much more. In one of Canada's top Chemical Engineering programs (Shanghai Global Ranking of Academic Subjects 2021), you’ll enhance your knowledge of physics, chemistry, biology, and math with engineering design and problem-solving skills. You’ll learn to transform raw materials into useful products as well as to design and control complex physical and chemical processes. Through North America's largest co-op program, you can apply your transferable skills in a wide range of jobs that support the transition to sustainable energy, minimize pollution, maximize food production, and enhance health care. During your six co-op terms, you'll be able to create an impressive résumé, explore potential career areas, and earn money to help pay for your education. Part of Canada's largest engineering school, the Department of Chemical Engineering at Waterloo is home to more than 1,200 students, faculty and staff, with thousands of alumni worldwide. During your first year, you'll take a mix of Chemical Engineering, math, and physics courses. In upper years, most of your classes will be in Chemical Engineering. Learn more about courses you'll take for your Chemical Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. When you graduate, you’ll find no shortage of career options in pharmaceuticals, pulp and paper, mining, oil and gas, food processing, health care, automotive, manufacturing, quality assurance, and more. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Engineers Without Borders, and more. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 200+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the low 90s Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1244",
            "program_name": "Electrical Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Our modern world is built on electricity. Learn to harness its power to create the next generation of electronics, sensors, and information networks. Your career will be super-charged by a degree from Waterloo. We're ranked top 25 in the world for electrical engineering (Shanghai World University Rankings 2021). You’ll study the fundamentals of electromagnetism, circuits, algorithms, and instrumentation. You will be able to specialize in a range of technologies such as power generation and clean energy, electric vehicles, Internet of Things, quantum computing, integrated circuit design, and machine learning. You'll also gain hands-on experience starting right in first year, thanks to paid co-op work terms and some of the best student labs in North America. When you graduate, you’ll have hundreds of career paths open to you, from designing power stations and aircraft control systems to pioneering the future of microprocessors and telecommunications systems. With its renowned co-op program and a supportive entrepreneurial ecosystem, Waterloo Engineering is one of the world’s top engineering schools. You'll have access to emerging technologies, innovative professors, and world-class facilities. During your first year, you'll take a mix of electrical and computer engineering, math, and communication courses. In upper years, most of the classes you'll take will be Electrical Engineering courses. Learn more about the classes you'll take for your Electrical Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Waterloo Electrical Engineering graduates often pursue careers in software development, manufacturing, telecommunications, aerospace, and more. They often work for engineering firms, technology companies, and manufacturing companies. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 200+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the low to mid-90s Previous experience in programming is recommended. Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1253",
            "program_name": "Architectural Engineering (Co-op only)",
            "uni_name": "University of Waterloo",
            "description": " Explore the science of building design combining engineering and architectural thinking. You will learn firsthand the impact of design choices on a building’s energy efficiency and carbon footprint, and learn about the challenges of updating aging buildings. You'll cover all the science and engineering that goes into good building design, including mechanics, structural analysis, structural design and more. In third year, you'll study at Waterloo's world-class School of Architecture, deepening your understanding of aesthetics, culture, and other elements of design. As a graduate, you'll be able to speak the language of both engineers and architects. Your knowledge will encompass the whole scope of building design, construction, assessment, and refurbishment, plus the communication skills that will put you on the fast track to leadership in the construction industry. Explore the science of design. Gain the technical know-how of an engineer while developing design skills through hands-on modelling and prototyping studio courses each term. Collaborate with architects. You'll spend third year at our School of Architecture in Cambridge, Ontario, working and connecting with talented Architecture students and gaining expertise in design. Leverage elements of architecture and civil engineering and become a graduate technically skilled in the whole scope of building design, construction, assessment, repair, and refurbishment. During your first year, you'll take a mix of foundational engineering, chemistry, and math courses. Learn about courses you'll take for your Architectural Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! You'll have your first co-op work term in January to April of your first year, alternating between four-month co-op work terms and four-month school terms. By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. You’ll be particularly well-suited to work in building design consulting firms of all sizes that house specialists relating to building design, e.g., interior designers, architects, structural, mechanical, and electrical engineers. However, you could also work for government public works departments, school boards and hospital authorities, private building infrastructure owners (e.g., airport authorities), building construction firms, developers, and more. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Formula Motorsports, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Regardless of gender, orientation, or background, you’re welcome to join this inclusive community to participate in outreach events as well as mentorship and volunteer opportunities. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 250+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. The Architectural Engineering program will be an accredited engineering program, so you’ll be able to work towards professional engineer (P.Eng.) status. Course content-wise, the program is actually closer to Civil Engineering than Architecture. Courses will cover content on mechanics, structural analysis and structural design, as well as heavy math content in the first two years. You'll have a better understanding of the science and engineering behind good building design – not just the structural aspects, but also energy efficiency, sustainable building design and smart/green building design. Architectural Engineering only covers enough about the aesthetic aspects of building design to be able to communicate intelligently with architects in their own language on this subject. In Architecture, these aesthetic aspects are a much greater focus. Architectural Engineering focuses heavily on building design. In contrast, Civil Engineering is a more general field with more breadth. The Civil Engineering curriculum includes design of large municipal infrastructure components. In both programs, you’ll take courses in structural analysis and design (i.e., how to determine forces in structures and size their members, connections, etc.). As an Architectural Engineering student, you’ll also take courses on building science and systems (such as HVAC) in the place of courses that Civil Engineering students take on transportation networks, water distribution systems, geotechnical engineering, and more. Architectural engineers work for design consulting firms specializing in the design, construction, renovation, and rehabilitation of buildings. Civil engineers are more likely to get jobs with government, provincial highway authorities, and construction companies. There is certainly some overlap between these programs. However, the Architectural Engineering program has been developed to address highly specified issues particular to building construction. Design has a very different meaning to engineers than it does to architects. There is not more or less in one program or the other – just different kinds of design. In comparison to Civil Engineering, Architectural Engineering includes more design and introduces design concepts much earlier on in the program. It can be said that the design in Architectural Engineering includes making decisions in addition to making calculations. This decision-making component is unique to the program and helps you address open-ended design problems. The main differences between Civil and Architectural Engineering in terms of learning style are the studio streams in Architectural Engineering. You’ll take a “studio” course every term, which will involve projects, model building, and synthesis of knowledge from other courses. You’ll have a desk in a studio, which will be your home for the entire term. This is similar to what Architecture students currently have. You'll also do your third year at the School of Architecture in Cambridge, where you’ll interact and eventually work on collaborative projects with Architecture students. In other respects, the program is very much an engineering undergraduate program. It is different from Architecture in all the same ways as any other engineering program. If you’re strong in math and science, interested in the technical aspects of building performance and design but relatively weaker in terms of artistic and creative abilities, you would potentially be more suited for Architectural Engineering. The skills required from you in these two programs would actually be similar. We expect it would primarily be interest and future career preferences which would drive you in one direction or the other. In both cases, we hope you'll choose Waterloo if you have a passion for the program and field of expertise to which you’re admitted. If you’re applying to Architectural Engineering or Civil Engineering, you’ll need to take high school chemistry. Architecture does not have this requirement. Architecture requires an interview and portfolio of creative work while Architectural Engineering and Civil Engineering don’t.  If you apply to Architectural Engineering or Civil Engineering, you’ll have the opportunity to complete an optional online interview.  Evidence of design and creative skills and interests will be considered an asset in Architectural Engineering much more than it would be in Civil Engineering. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the high 80s The Admission Information Form is required for admission. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1254",
            "program_name": "Civil Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " Population growth, climate change, and aging infrastructure are some of the big challenges that today’s civil engineers tackle in the quest for smart cities and a sustainable future. As a civil engineer, you’ll lead the creation, maintenance, and management of the large-scale infrastructure we all depend upon. During your six paid co-op work terms, you can test drive different career options. Work for major construction and engineering companies, get experience with local or provincial governments, or spend a term abroad. This is a degree with lots of flexibility. You’ll have access to a wide range of electives, allowing you to customize your education to suit your interests and career goals. By the end of your degree, you’ll be ready to design, analyze, construct, and manage everything from airports and skyscrapers to bridges, transportation networks, municipal water systems, and more. Population growth, climate change, and aging infrastructure are some of the big challenges that today's civil engineers tackle in the quest for smarter cities and a sustainable future. As a civil engineer, you'll lead the creation, maintenance, and management of the large-scale infrastructure we all depend upon. During your first year, you'll take a mix of engineering and math courses. In upper years, most of your classes will be in Civil Engineering. Learn more about courses you'll take for your Civil Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Graduates often pursue careers where they oversee projects focusing on planning, design, and construction of the large-scale infrastructures around us. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Formula Motorsports, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 250+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the high 80s Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        },
        {
            "program_key": "1255",
            "program_name": "Mechanical Engineering (Co-op Only)",
            "uni_name": "University of Waterloo",
            "description": " If you love things that move, this is your program. At Waterloo, you’ll develop the skills you need to design everything from switches to spacecraft. You’ll get a broad foundation in all aspects of mechanical design: mechanics, power, control, and manufacturing. You’ll also learn to lead large, multidisciplinary teams, solve problems, come up with high-impact innovations, and have the chance to apply it all to real work experiences in co-op. Where you use those skills is up to you. Mechanical engineers work in all kinds of fields, constantly looking for ways to make machinery faster, lighter, cleaner, and more reliable. And with two years of career-relevant experience on your résumé by the time you graduate, you’ll definitely impress potential employers. Become a skilled problem solver, leader, and innovator able to create mechanical systems and electro-mechanical designs that impact industries and improve the world. During your first year, you'll take a mix of foundational engineering and math courses. In upper years, most of the classes you'll take will be in Mechanical Engineering. Learn more about the courses you'll take for your Mechanical Engineering degree. Join our monthly newsletter for tips such as choosing a university program, life at Waterloo, and finances. Ask a Faculty of Engineering student about their program, classes, getting involved on campus, and more! By alternating school terms and paid co-op work terms throughout your degree, you can explore new career areas and types of employers as your career interests evolve. Waterloo graduates often pursue careers in automation, automotive aerospace, and forensics. They commonly work for media companies, technology companies, vehicle manufactures, and more. Learn about the future of careers in engineering. Have fun and develop hands-on experience through one or more of our 20+ student-led design teams! Design teams include rocketry, concrete canoe, robotics, solar car, submarine racing, autonomous vehicle, Space X Hyperloop, Engineers Without Borders, and more. You’ll meet people with similar interests and goals, benefit from networking with experts in the engineering profession, and develop some great skills for your résumé. Women in Engineering (WiE) supports female students and engineers while encouraging the next generation of women to pursue careers in engineering. Any student is also welcome to join Women in Science, Technology, Engineering, and Mathematics (WiSTEM), a student-run club that promotes equality in STEM through skills workshops, discussions, and guest speakers. EngSoc is run by students for students and provides many social and academic events and services to make your experience as a Waterloo Engineering student the best it can be. Benefit from mentoring for first-year students or get involved and meet other students through an annual conference, semiformal, career fair, charity events, community outreach, and much more! Our campus is packed with opportunities to get involved – no matter how unique your interests. Between our 200+ student-run clubs, sports and recreation opportunities, student government, and events, student life at Waterloo has something for everyone. Ontario students: six Grade 12 U and/or M courses including Admission averages: Individual selection from the low to mid-90s Complete the Admission Information Form once you've applied. Not studying in Ontario? Search our admission requirements. Apply directly to this program on your application.",
            "image_url": null
        }
    ]
}